package chap08;

public class InterfaceDesc {

    //인터페이스는 사전적 의미로 두 장치를 연결하는 접속기를 말한다.
    //실무에서는 A DB 에서 B DB로 데이터를 주고 받는것도 인터페이스
    //재무관리 시스템에서 인사관리 시스템으로 데이터를 주고받는것도 인터페이스 라고 부른다.

    //인터페이스 = 설계도
    //SI 5 ~ 30,40명 그중에서 고급개발자 10년차 이상(팀장)
    //인터페이스 작성
    //초 ~ 중급 개발자 (팀원) 그 실체를 구현한다.
    //필요한 파라메터 반환값 메소드명 다 정해져있기때문에
    //설계에서 벗언날 일이 줄어든다.

    //인터페이스는 추상클래보다 엄격한 설계, 추상화 되어있다.
    //추상화는 구현 세부정보를 숨기는 일반 인터페이스를 지정하는 행위.

    //차를 운전할때 인터페이스(스티어링 휠, 페달, 버튼 ... )
    //이 인터페이스는 차량 제조사에 의해 노출이 되어있다.
    //우리는 해당 인터페이스를 활용해서 차를 조종한다.
    //구현 세부정보는 노출되어 있지 않다.
    //따라서 운전자는 브레이크나 엔진이 어떻게 작동하는지 세부정보를 모르는 채로 운전할 수 있다.

    //추상화의 큰 장점 중 하나는

    //자바 class에서는 단일 상속
    //인터페이스에서는 다중 상속을 구현하게 해주는 고급기술

    //인터페이스 상속


}
