package chap10;

public class LibraryDesc {
    //라이브러리 프레임워크
    //둘 다 누군가가 작성한 코드를 가져다쓴다 라는 공통점이 있다.

    //구분하는 가장 간단한 방법은
    //누가 누구를 컨트롤 하는가

    //내가 직접 코드를 컨트롤 = 라이브러리
    //누군가 정해둔 룰에 따라서 내 코드가 불리워지면 = 프레임워크  spring

    //라이브러리는 내가 필요할 때 해당코드를 불러서 사용한다.
    //라이브러리는 교체도 할 수 있고
    //버전도 쉽게 바꿀 수 있다.
    //라이브러리를 교체하거나 버전을 바꿔도 프로젝트 망가지진 않는다.

    //프레임워크는 내가 원할 때 코드를 부르는 게 아니라
    //프레임워크가 우리의 코드를 부른다.
    //예를 들어서 스프링의 특정한 설정을 바꾸고 싶다 하면
    //app.properties 에 이미 정해진 규칙대로 코드를 작성해야한다.


    //라이브러리를 추가하는 방법
    //maven gradle
    //프로젝트에 직접 추가하는 방법
    //.jar (Java ARchive) 형태로 존재한다.




}
